Repository: MR-suresh-454-14/project-Medicine-Info
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ta

source: Search Tablet
ta: மருந்து தேடல்

source: Enter Medicine name ( Tablets , Ointments )
ta: மருந்தின் பெயரை உள்ளிடவும் ( மாத்திரைகள் , பூச்சுகள் )

source: Please enter a tablet name to search.
ta: தேட மருந்தின் பெயரை உள்ளிடவும்.

source: Please enter at least 2 characters.
ta: குறைந்தபட்சம் 2 எழுத்துக்கள் உள்ளிடவும்.

source: Please enter a tablet name.
ta: மருந்தின் பெயரை உள்ளிடவும்.

source: Benefits and side effects of "{name}"
ta: "{name}" மருந்தின் நன்மைகள் மற்றும் பக்கவிளைவுகள்

source: Search Tablets
ta: மருந்துகளை தேடுங்கள்

source: Medicine Information
ta: மருந்து தகவல்

source: Get clear and simple information about medicines
ta: மருந்துகள் பற்றிய தெளிவான மற்றும் எளிய தகவலைப் பெறுங்கள்

source: Search for a Tablet
ta: மருந்து தேடுங்கள்

source: Get Medicine Info
ta: மருந்து தகவலைப் பெறுங்கள்

source: Start typing to see suggestions...
ta: பரிந்துரைகளை காணத் தட்டச்சு செய்யத் தொடங்கவும்...

source: This information is for educational purposes only. Always consult a healthcare professional.
ta: இந்த தகவல் கல்வி நோக்கங்களுக்காக மட்டுமே. எப்போதும் மருத்துவரை அணுகவும்.

source: Safe if used correctly
ta: சரியாக பயன்படுத்தினால் பாதுகாப்பானது

source: Consult doctor if unsure
ta: சந்தேகம் இருந்தால் மருத்துவரை அணுகவும்

source: Benefits
ta: நன்மைகள்

source: Side Effects
ta: பக்கவிளைவுகள்

source: Dosage & Timing
ta: அளவு & நேரம்

source: Age Group
ta: வயது குழு

source: Storage Instructions
ta: சேமிப்பு வழிமுறைகள்

source: Drug Interactions
ta: மருந்து தொடர்புகள்

source: This information is educational. Please consult a doctor before using this medicine.
ta: இந்த தகவல் கல்வி நோக்கங்களுக்காக மட்டுமே. மருந்தை பயன்படுத்தும் முன் மருத்துவரை அணுகவும்.

source: Back to Search
ta: திரும்பிச் செல்ல

source: Share
ta: பகிரவும்
